import React, { useEffect } from 'react';
import dead from "./img/deadSamur.jpg";

const News = () => {
    useEffect(() => {
        const didCompleteTasks = prompt("You did all today tasks? Yes or No?");

        if (didCompleteTasks && didCompleteTasks.toLowerCase() === 'y') {
            alert("You`re amazing! Now you can read news");
        } else {
            alert("Don`t forgot to do all tasks before read!");
        }
    }, []); // Викликається лише при монтажі компоненту (при першому рендері)

    return (
        <div>
            <img
                src={dead}
                alt="dead"
                style={{ width: '100vw', height: '100vh'}}
            />

            <div>
                <p>
                    Вперше слово бушідо було засвідчене у 1616 році у творі Койо Ґункан (яп. 甲陽軍鑑, трансліт. Kōyō Gunkan), військовій хроніці, що описує подвиги клану Такеда, але поява бушідо пов'язана з японським феодалізмом і першими сьоґунами за часів Мінамото но Йорітомо в 11 столітті. Однак моральний вимір, властивий бушідо, поступово з'являється в воїнській культурі й простежується в оповіданнях і військових трактатах лише починаючи з 14-15 ст. Таким чином, можна прослідкувати постійність сучасного уявлення про його стародавність в японській культурі та його поширення.

                    Так, в епоху війни Ґемпей, його називали «Шляхом Лука і Коня» (яп. 弓馬の道, трансліт. kyūba no michi)[2] через величезне значення цього стилю бою для воїнів того часу, а також тому, що він вважався традиційним методом бою найдавніших самурайських героїв, таких як принц Сьотоку, Мінамото но Йоріміцу і Мінамото но Йосіїе (Хатіман Таро). Згідно з французьким дослідником сходознавства Луї Фредеріком,[3] «kyūba no michi» з'явився приблизно в 10 столітті як набір неписаних правил і звичаїв, яких самураї, як вважалося, мали дотримуватися.

                    Приблизно у 10-11 ст. почали використовувати вирази на кшталт «шлях воїна» (tsuwamon no michi), «шлях лука і стріл» (kyûsen / kyûya no michi), «шлях лука і коня» (kyûba no michi). Ці вирази відсилають до практик, що були предками шляху воїна (бушідо), але тоді вони не мали ніякого зв'язку з мораллю. Йшлося лише про практики, зосереджені на тренуваннях для реального бою, які тому були пов'язані зі способом життя самураїв у широкому сенсі.

                    У середньовічний період (12-16 століття) світ воїнів зазнав впливу буддизму, який наголошував на тому, що не можна вбивати живих істот. Деякі самураї відчували себе пов'язаними з поганою кармою перед обличчям смерті, в той час, як інші визнавали свою провину. Буддійська концепція мінливості підкреслювала крихкість життя. Найбільше поширився саме дзен-буддизм, що підкреслював єдність між життям і смертю.[2]

                    Насправді існує непорозуміння щодо терміну, який стосується самурайського кодексу, що виникло через містифікацію певних фактів істориками, зокрема японськими. Серед класів були буші, підофіцери та офіцери нижчого рангу, і буке, офіцери вищого рангу, що належали до дворянства. Самураї належать до категорії буке, і їхній кодекс на ділі мав назву - буке-сьо-хатто, який був оприлюднених з 1615 по 1710 рік сьогунатом Токугава. Тому те, що «бушідо» є кодексом самурая, насправді є фікцією.

                    Історія
                    Концепція, що лежить в основі бусідо, значно розвинулася в період Камакура, ґрунтуючись на кодексі поведінки самураїв (починаючи з періоду Хейан). Вона диктує, що ті, хто володіє бойовою майстерністю, повинні ретельно розвивати, тренувати і керувати собою, і не повинні потурати егоцентризму чи особистим справам. Це представляє унікальну японську кодову свідомість.

                    Поняття «не потурати егоцентризм» поступово поширилося на ширші суб'єкти (простих людей, живі істоти, науку, мистецтво, суспільні традиції тощо). Водночас, ідея самураїв, які жертвували своїм життям заради своєї організації, стала прославлятися в ранньомодерну епоху.

                    За часів Едо панівний клас, самураї, були зобов'язані тренуватися як у цивільному, так і у військовому мистецтві та нести повну відповідальність за свої дії власним життям. Самурай, який підняв меч у приватних справах, ніс відповідальність за свої дії, і було багато таких, хто не здіймав меча до кінця свого життя. Крім того, сьоґунат іноді наказував феодалу території, на якій відбувалися громадянські заворушення, вчинити сеппуку.<br/>
                    Зародження

                    Японський самурай в обладунках, 1860-х років. Фотограф Felice Beato
                    У період Камакура Японія стала свідком повної ініціації самурайського політичного правління, утверджуючи позиції класу самураїв. Одночасно з цим з Китаю був занесений дзен-буддизм, який суттєво вплинув на самурайський стан. Саме тут з'явилася основа самурайського кодексу, відомого як «Шлях лука і коня»).[4] Це ознаменувало зародження етичних настанов самурайського життя (що збігається з розвитком лицарства в західному контексті). Протягом періоду Муроматі до періоду Сенґоку процвітали різні стилі, зосереджені навколо самураїв, що сягають корінням у культуру епохи Муроматі. У бойових мистецтвах було створено три основні лінії фехтування на мечах, а в мистецтві театр Но і чайна церемонія зробили свій внесок у розвиток самурайської культури. Хоча термін «бушідо» ще не використовувався під час цієї послідовності епох, чіткі цінності (естетичні та моральні), унікальні для самураїв, відмінні від цінностей придворних та інших суспільних класів, безсумнівно, були присутні.

                    Термін «бусідо» вперше був зафіксований в Японії на початку періоду Едо, а саме у творі Койо Ґункан (яп. 甲陽軍鑑, трансліт. Kōyō Gunkan), який приписується слузі Такеда Касуґа Торатане (Такасака Масанобу). У цьому контексті «бусідо» означає особисту стратегію виживання для воїнів, що зосереджується на покращенні своєї репутації на користь собі та своєму клану. Це поняття знайшло своє відображення у сімейному заповіті Тодо Такатори: «Ніхто не може називатися самураєм, якщо він не змінив пана сім разів». Це також підтверджує практику ставати роніном (самураєм без пана), щоб шукати пана, який цінує і поважає твої навички. Крім того, такі настрої, як «Воїн може бути подібний до собаки чи звіра, але перемога в бою є важливою», ілюструють сувору філософію, яка ставила на перше місце перемогу в битві, навіть перед обличчям звинувачень у безчесті. Ці цінності насамперед стосуються способу життя самураїв і слугують орієнтиром для життя васала. Так званий «бущідо», про який говорять повсюдно, відрізняється за своєю суттю/Wikipedia/

                    У період Едо термін «бушідо» іноді використовувався як взаємозамінний з «Будо», але пізніше він став позначати саме бойові мистецтва.
                </p>
            </div>
        </div>
    );
};

export default News;